app/views/invoices/_form.html.erb

SELECT  "invoices".* FROM "invoices"  ORDER BY "invoices"."id" DESC LIMIT 1
---
                      <div class="field">
                        <% if Invoice.last == nil %>

SELECT "products".* FROM "products"  ORDER BY "products"."product_name" ASC
---
                                <h6><strong>Product</strong></h6>
                                <% f.collection_select :product, Product.order(:product_name),:product_name,:product_name , :class => "form-control" %>

SELECT "products".* FROM "products"
---
                                  <option>-- Select Product --</option>
                                  <% Product.all.each do |product| %>