app/views/invoices/index.html.erb

SELECT "invoices".* FROM "invoices" WHERE (invoice ='INV001')
---
                    <% @invoices.each do |invoice| %>
                      <% @subInvoice = Invoice.where("invoice =?",invoice.invoice) %>