app/controllers/invoices_controller.rb

  def index
    @invoices = Invoice.all
    if params[:search]
      @invoices = Invoice.search(params[:search]).order("invoice ASC")
    else
      @invoices = Invoice.select(:invoice).uniq
---
SELECT "invoices".* FROM "invoices" WHERE (invoice ='INV001')
SELECT DISTINCT "invoices"."invoice" FROM "invoices" WHERE (customer_email LIKE '%7875223701%' OR product LIKE '%7875223701%' OR CAST(customer_phone AS TEXT) LIKE '%7875223701%')  ORDER BY invoice ASC

  def create
    @invoice = Invoice.new(invoice_params)
    @details = params[:invoice]
    @product = params[:ProdName] #product - list
    @rate = params[:Rate]# rate - list
    @quantity = params[:Quantity]# quantity - list
    @amount = params[:Amount]# amount - list

    @date = params[:date]

    puts "date is " + @details["date"].to_s# year - month - date

    new_records = Array.new
    successFlag = 0

    for i in 0..@rate.length - 1
      new_records = {:customer_name => @details["customer_name"].to_s, :customer_phone => @details["customer_phone"], :customer_email => @details["customer_email"].to_s, :invoice =>  @details["invoice"].to_s, :invoice_date => @details["date"], :product => @product[i].to_s, :rate => @rate[i].to_f, :quantity => @quantity[i].to_i, :amount => @amount[i].to_f }
      @invoiceS = Invoice.new(new_records)
      if @invoiceS.save
---
INSERT INTO "invoices" ("customer_name", "customer_phone", "customer_email", "invoice", "invoice_date", "product", "rate", "quantity", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"