app/controllers/products_controller.rb

  def index
    @products = Product.all.order("rate asc")
---
SELECT "products".* FROM "products"  ORDER BY rate asc

  def create
    @product = Product.new(product_params)

    if params[:product]
      check = Product.find_by(:product_name => params[:product]["product_name"].capitalize)
      if check.present?
        puts "present"
        respond_to do |format|
          format.html { redirect_to @product, notice: 'Product already present.' }
          format.json { render :index, status: :created, location: @product }
        end
      else # if thedata is not present
        new_records = Array.new
        new_records = {:product_name => params[:product]["product_name"].capitalize, :rate => params[:product]["rate"].to_f}
        @productS = Product.new(new_records)

        respond_to do |format|
          if @productS.save
---
SELECT  "products".* FROM "products" WHERE "products"."product_name" = $1 LIMIT 1  [["product_name", "djfn"]]
INSERT INTO "products" ("product_name", "rate", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_name", "2\" screws"], ["rate", 10.0], ["created_at", "2016-07-04 11:37:27.035793"], ["updated_at", "2016-07-04 11:37:27.035793"]]